Readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Readme</title>
<!-- 2016-09-01 Thu 09:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/style.css" rel="stylesheet"></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index"> HOME </a>
</div><div id="content">
<h1 class="title">Readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Hello!</a></li>
<li><a href="#sec-2">2. A starter kit for magicians</a>
<ul>
<li><a href="#sec-2-1">2.1. Working with the Emagicians Starter Kit</a></li>
<li><a href="#sec-2-2">2.2. Installing</a></li>
<li><a href="#sec-2-3">2.3. Customizing</a></li>
</ul>
</li>
<li><a href="#sec-3">3. A note about tone</a></li>
<li><a href="#sec-4">4. Dedication</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Hello!</h2>
<div class="outline-text-2" id="text-1">
<div class= "notice notice-info">
<p>
Project Status:
</p>

<p>
Fit for other humans to tell me it is broken, and I can fix it.
</p>

<p>
But Not Even Alpha.
</p>
</div>

<p>
🐰,(hello!)
</p>

<div class="notice notice-warning">
<p>
What is here is not on the master branch, but is instead in the v2 branch. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A starter kit for magicians</h2>
<div class="outline-text-2" id="text-2">
<p>
I stand on the shoulders of giants to weave my own spells.  
</p>

<p>
I got tired of my old .emacs file, and poorly maintained collection
of extensions, that was working less and less well, the more time
went on and on.  So I made the Emagicians Starter Kit.
</p>

<p>
I Love the idea of the starter kits, but I found they made too many
assumptions and just wasn't fit for what I needed.  I also have a
bit of a "not-invented-here" problem.  It's minor and I cope pretty
well. However with regards to emacs: (and to to paraphrase Douglas
McArther Shaftoe from the Neal Stephenson novel <i>Cryptonomicon</i>.)
</p>

<blockquote>
<p>
This is my Emacs.  There are plenty like it, but this one is mine.
</p>
</blockquote>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Working with the Emagicians Starter Kit</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Son, there is no brogramming here.  No easy install shell file that
you can just run, and everything goes.  In fact, it is antithetical
to the whole concept of the emagicians starter-kit.  Instead this
starter kit has org-mode super-powers. 
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Installing</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Installing, customizing, and making it go is as easy as opening the
<a href="./Emagician-Install.html">./Emagician-Install.html</a> and then following instructions.
There are plenty of code blocks in there that will get you started
for installing and testing.  Basically, you shouldn't ever need to
leave the comfort of your org-mode buffer.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Customizing</h3>
<div class="outline-text-3" id="text-2-3">
<p>
If you need to customize the emagician starter kit, I provide you
with a way to do it based on:
</p>

<ul class="org-ul">
<li>Your True Name
</li>
<li>Machine Name
</li>
<li>Login Name
</li>
</ul>

<p>
Most of the instructions are on the Install File. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A note about tone</h2>
<div class="outline-text-2" id="text-3">
<p>
If your primary tool, as both hobby and vocation is your text
editor, does it not then follow that it is one of the fundamentally
important things in your life?
</p>

<p>
But then, would that not put it on the same footing as ones spirituality?
</p>

<p>
What if ones spirituality is Militant Agnostic Zenarchic Discordianism?
</p>

<p>
Then you would write an Emagicians Startup Kit full of tongue in
cheek references to the western magickal tradition, and venerate Eris constantly.
</p>

<p>
That's what.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dedication</h2>
<div class="outline-text-2" id="text-4">
<p>
To My Wife:  Shell Arkell.  The most important person in my life,
who outshines all other people, like the noon-day sun outshines the
stars.
</p>

<p>
🌞 I Love you. 🌞
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2016-09-01 Thu 09:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
